pascal-3.2/tutorials/surfaceTracking/newInterTrackFoam/capillarity2DoneFluid/0/contactAngle
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       edgeScalarField;
    location    "0";
    object      contactAngle;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

// internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type calculated;
        value uniform -70;
    }
    right
    {
        type calculated;
        value uniform -70;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
